package day4;

public class For9 {

	public static void main(String[] args) {
		/* 무한루프 : 반복문이 끝나지 않는 경우
		 * */
		for(;;) {
			// System.out.println("무한루프에 빠졌을땐 콘솔창 오른쪽에 있는 빨간색 네모 버튼을 누르세요");
		}
		// System.out.println("Hi"); - 위에가 무한루프이기 때문에 현재 Hi 는 에러라고 나옴(error : Unreachable code)
		
		/* 꿈을 찾기 위해 공부는 과정
		 * 다만, 그 과정이 꿈을 이루는데에 제약이 있으면 안됨
		 * 예를 들어 의사를 하고 싶은데 성적이 낮으면 의대를 진학할 수 없음
		 * 반대로 집을 짓는 사람이 되고 싶으면 성적은 집을 짓기 위한 공부를 할 수 있는 정도 까지만 하면 됨(가령 대학교 건축공학과 석사까지 가도 되고 본인 선택에 따라 다름)
		 * 어렸을때는 공부를 잘하는 것보다 내가 나중에 무슨 일을 하면 좋을까 하는 생각을 해야함
		 * 그리고 무슨 일을 하는데 있어서 그 일을 내가 할 때 즐거운지, 잘하는지, 쉽게 하는지 등 본인에 맞는 일인지를 찾아야 함
		 * 공부를 잘하면 다양한 일을 할 수 있지만, 공부를 못하면 할 수 있는 일이 한정적임
		 * 그렇다고 공부를 잘해서 다양한 일을 하는 것보다 공부를 하기 전에 무슨 일을 하고싶은지를 찾고 그것을 위해 공부를 하는 것이 좋을 듯
		 * 그리고 남는 시간에 본인이 하고 싶은 일에 시간을 투자해서 학교 교과 외의 공부를 하면 좋음
		 * 
		 *  */ 
	
	}

}
