package day19;

public class Rewind2 {

	public static void main(String[] args) {
		/* 연산자
		 * 	- 연산자 종류와 결과
		 * 	- 산술 연산자( +, -, *, /, % )
		 * 		-> / : 정수 / 정수 일 때 정수가 되어서 소수점이 사라짐(부정확한 데이터) => 타입변환을 통해 (double) 정수 / 정수 로 하여 실수값이 나오도록 해야 함
		 * 		-> % : 나머지를 확인하는 연산자로 나누었을 때 나머지에 해당
		 * 		-> 산술 연산자의 계산 결과 값은 값
		 *  - 대입 연산자( = ) : 오른쪽에 있는 값을 왼쪽에 저장. 왼쪽에는 변수가 1개 와야 함. 저장, 덮어씀, 초기화 등의 표현. 결과값은 값 또는 주소값
		 *  - 증감 연산자( ++, -- ) : 최종적으로 1 증가 또는 1 감소. 전위형(증가하고 동작), 후위형(동작하고 증가). 결과값은 값 
		 * 	- 비교 연산자( <, <=, >, >=, ==, != ) : 크기 비교. 일반 변수의 크기를 비교 할 때 사용. 결과값은 참 또는 거짓(논리값). ==와 대입연산자 = 를 혼동하지 말자 
		 *  - 논리 연산자( &&, ||, ! ) : 결과값은 참 또는 거짓(논리값)
		 *  	-> && : ~ 하고, ~ 이고. 둘 다 참이면 참, 나머지는 거짓. 둘 다 거짓이면 거짓, 나머지는 참.
		 *  	-> || : ~ 거나. 둘 다 거짓이면 거짓, 나머지는 참
		 *   	-> ! : ~가 아닌. 반대의 개념(참이면 거짓, 거짓이면 참)
		 *  - 조건선택연산자( (조건식) ? (참) : (거짓) ) : 조건식이 참이면 참에 해당하는 부분을 실행, 거짓이면 거짓에 해당하는 부분을 실행
		 *  - 조건식 : 연산결과가 참 또는 거짓이 되는 식
		 *  - 연산자 우선 순위 : ()가 제일 높음 
		 * 	 */
	}
}