package day19;

public class Rewind8 {

	public static void main(String[] args) {
		/* 인터페이스(기능명세서)
		 *  - 상수와 추상메소드만 있을 수 있음 
		 *  - 인터페이스를 사용하여 객체를 생성할 수 없음
		 *  - 구현 클래스를 생성한 후 객체를 만들 수 있음
		 *  - 상속은 extends, 구현은 implements를 사용
		 *  - 구현 클래스는 여러개의 인터페이스를 구현할 수 있다.
		 *  - 구현 클래스에서는 인터페이스에 있는 메소드들을 오버라이딩 해야 한다.
		 *  */
		
		/* 익명객체 
		 *  - 클래스를 상속 받아서(인터페이스를 구현해서) 이름 있는 클래스로 만드는 것이 아니라 한 번 사용할 용도로 이름없는 클래스를 만들어 객체를 생성하는 것 -> 딱 한번만 쓸 때 사용
		 *  - 일반적으로 익명 객체를 사용하는 경우 새로운 멤버변수와 메소드를 생성하지 않고 부모클래스에 있는 메소드나 인터페이스에 있는 메소드를 오버라이딩 해서 사용할 때 익명 객체를 사용 */
	}

}
