package day19;

public class Rewind {

	public static void main(String[] args) {
		/* 변수
		 *  - 변수선언 방법
		 *  	-> 변수타입 변수명;
		 *  		* 기본 타입 종류 와 값
		 *  			- 정수형
		 *  				-> int, char, ...
		 *  			- 실수형
		 *  				-> double, float, ...
		 *  			- 논리형
		 *  				-> boolean, ...
		 *  		* 변수명 작성 규칙
		 *  			- 숫자로 시작할 수 없다
		 *  			- 예약어를 사용할 수 없다
		 *  			- 특수문자는 $와 _만 가능
		 *  			- 중복선언 불가
		 *  			- 대소문자 구별
		 *  		* 변수명 작성 관례
		 *  			- 변수명은 소문자로 한다
		 *  			- 상수는 대문자로 한다
		 *  			- 카멜 표기법 : 변수명이 두 단어 이상으로 되어 있을 때 두번째 단어부터 첫 글자만 대문자로 표기
		 *  			- 클래스는 첫 글자를 대문자
		 *  			- 변수명/메소드/클래스명은 의미있는 단어로 작성
		 *  - 일반변수
		 *   1. 기본타입으로 선언한 변수
		 *   2. 값을 저장
		 *   3. ==로 비교
		 *  - 참조변수
		 *   1. 기본타입이 아닌 배열, 클래스, 열거형으로 선언한 변수
		 *   2. 주소를 저장
		 *   3. 기본타입 배열은 ==로 비교, 클래스 배열인 경우 equals 메소드 이용하여 비교, 열거형 배열은 ==를 이용하여 비교한다.
		 *  - 지역변수 : 사용하는 지역이 일부(메소드 하나, 반복문 한 곳 등) 인 경우 
		 *  - 멤버변수 : 클래스의 멤버로, 사용하는 지역이 클래스 전체인 경우(멤버변수의 종류에 따라 사용 할 수 없는 메소드가 있을 수 있다)   
		 *  - 매개변수 : 메소드를 동작시키기 위해 알려주는 정보. 지역변수. 멤버변수와 매개변수의 우선순위는 매개변수가 높음
		 *  - 클래스 멤버변수 : static이 붙은 멤버변수, 클래스를 통해 호출
		 *  - 객체 멤버변수 : static이 안 붙은 멤버변수, 객체를 통해 호출(대부분 getter를 이용)
		 *  
		 *  - 하나의 변수는 변수 종류 중 한가지에만 속한다 - (거짓)
		 *   */
	}
}