package day20;

public class Requirement {

	public static void main(String[] args) {
		// 웹 개발 단계
		/* 1. 요구사항 명세서       		-- 고객
		 * 2. 스토리보드 작성     		  	-- 개발자 ~ 
		 * 3. 디자인 시안, 	ERD 설계 
		 * 4. 화면 구현, 		백엔드 개발 */
		
		/* 요구사항 명세서 작성 이유
		 *  - 프로젝트 전체 규모를 파악 
		 *  - 구현 가능 여부에 대해 논의할 수 있음
		 *  - 커뮤니케이션 비용 절약
		 *  - 프로젝트 일정 계획 수립 */
		
		/* 요구사항 명세서 작성 항목
		 * 	- ID : 요구사항을 구별하기 위한 값
		 *  - 화면명 : 어느 화면에서 구현할 기능인지 작성
		 *  - 요구사항명 : 요구사항 설명 요약
		 *  - 내용 : 요구사항 상세를 작성
		 *  - 작성날짜
		 *  - 중요도(우선순위) : 1~5, 상중하 등으로 표시
		 *  - 버전
		 *  - 진행사항 여부
		 *  - 참고  */
		
		/* 좋은 요구사항 명세서의 특징
		 *  1. 요구사항 명세서를 읽은 작업자가 이해하기 쉬워야 한다.(혼동의 여자기 없다)
		 *  2. 명확하게 작성한다.
		 *  3. 하나의 요구사항에 대해 여러가지 요구사항을 작성하지 않는다.
		 *  4. 애매한 단어를 사용하지 않는다.(예 : ~ 한 기능이 있으면 좋겠다 -> ~한 기능이 필요하다)
		 *  5. 중요한 요구사항은 표시하되 남발하지 말자. 
		 *  6. 동일한 용어를 사용한다.(댓글이라고 표현하면 이후에도 댓글로 표현해야 함)
		 *   */
		
	}

}
